Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛевоПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
	ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"
	ИЛИ ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛевоПраво(Форма)    

	ПолеВвода1 = Форма.Элементы.Добавить("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
    ПолеВвода1.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода1.ПутьКДанным = "Объект.КонтактноеЛицо";  
	
	Группа = Форма.Элементы.Добавить("НоваяГруппа", Тип ("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево); 
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	ПолеВвода2 = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип ("ПолеФормы"), Группа);     
	ПолеВвода2.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода2.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВвода2.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПересчетПриИзменении");
				
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьСтоимость");
	НоваяКоманда.Заголовок = "Пересчитать стоимость";
    НоваяКоманда.Действие =  "ОбработкаКомандыПересчитатьСтоимость";
	
    НоваяКнопка = Форма.Элементы.Добавить("КнопкаПроверки", Тип ("КнопкаФормы"), Группа); 
	НоваяКнопка.ИмяКоманды = "ПересчитатьСтоимость";   
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;	
	
КонецПроцедуры  

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)    

	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";    

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)   
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип ("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";    

КонецПроцедуры

